---
kind: method
id: M:Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetResultSchema(System.Int32)
source: html/4e236ada-5098-9e8c-e23e-2efb06916565.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.GetResultSchema Method

Returns result schema by index

## Syntax (C#)
```csharp
public AnalysisResultSchema GetResultSchema(
	int idx
)
```

## Parameters
- **idx** (`System.Int32`) - Index of registered result schema

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentException** - idx refers to non-existent result schema